tap "charmbracelet/tap"
tap "clojure/tools"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jorgelbg/tap"
tap "moreal/brew"
tap "oven-sh/bun"
tap "planetarium/brew"
tap "siderolabs/tap"
tap "spring-io/tap"
brew "git"
brew "asdf"
brew "ast-grep"
brew "bat"
brew "chezmoi"
brew "clojurescript"
brew "codex"
brew "coreutils"
brew "coursier"
brew "cspell"
brew "curl"
brew "deno"
brew "difftastic"
brew "duckdb"
brew "erlang"
brew "fedify"
brew "ferron"
brew "ffmpeg"
brew "flyctl"
brew "fswatch"
brew "fzf"
brew "gh"
brew "ghcup"
brew "openjdk@21"
brew "ghidra"
brew "git-delta"
brew "glow"
brew "gnupg"
brew "hunspell"
brew "haskell-stack"
brew "hledger"
brew "htop"
brew "hugo"
brew "internetarchive"
brew "ktlint"
brew "lychee"
brew "mactop"
brew "mise"
brew "mysql"
brew "mysql-client@8.0"
brew "mysql@8.0"
brew "neovim"
brew "node@22"
brew "nushell"
brew "ollama", restart_service: :changed
brew "opam"
brew "openjdk@17"
brew "pandoc"
brew "parallel"
brew "pinentry-mac"
brew "pkgconf"
brew "postgresql@17"
brew "protobuf"
brew "qemu"
brew "rclone"
brew "redis"
brew "ruff"
brew "sbcl"
brew "scala"
brew "shellcheck"
brew "typst"
brew "uv"
brew "vim"
brew "watchman"
brew "yamlfmt"
brew "yt-dlp"
brew "zellij"
brew "zig"
brew "zola"
brew "charmbracelet/tap/crush"
brew "clojure/tools/clojure"
brew "jorgelbg/tap/pinentry-touchid"
brew "oven-sh/bun/bun"
brew "siderolabs/tap/talosctl"
brew "spring-io/tap/spring-boot"
cask "defold"
cask "font-hack-nerd-font"
cask "ghidra"
cask "ghostty"
cask "gitify"
cask "inkscape"
cask "jetbrains-toolbox"
cask "lm-studio"
cask "logseq"
cask "mitmproxy"
cask "mysql-shell"
cask "ngrok"
cask "orbstack"
cask "planet"
cask "rectangle"
cask "secretive"
cask "servo"
cask "smlnj"
cask "utm"
cask "visual-studio-code"
cask "warp"
cask "wezterm"
cask "zed"
vscode "anthropic.claude-code"
vscode "arcanis.vscode-zipfs"
vscode "ast-grep.ast-grep-vscode"
vscode "astral-sh.ty"
vscode "astro-build.astro-vscode"
vscode "azdavis.millet"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "chenglou92.rescript-vscode"
vscode "coderabbit.coderabbit-vscode"
vscode "denoland.vscode-deno"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql-syntax"
vscode "haskell.haskell"
vscode "justusadam.language-haskell"
vscode "meta.pyrefly"
vscode "meta.relay"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.hexeditor"
vscode "ms-vsliveshare.vsliveshare"
vscode "ocamllabs.ocaml-platform"
vscode "oven.bun-vscode"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "vitest.explorer"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "ziglang.vscode-zig"
cask "anki"
brew "cargo-shear"
brew "ccusage"
brew "repomix"
brew "difftastic"
tap "afnanenayet/tap"
brew "diffsitter"
brew "opencode"
brew "go@1.25"
brew "cmake"
brew "lld"
brew "llvm"
cask "font-sarasa-gothic"
brew "direnv"
tap "bglgwyng/tap"
brew "bglgwyng/tap/lat"
cask "font-pretendard"
tap "simnalamburt/x"
brew "simnalamburt/x/input-source"
